STL = {}
L = {}

-- Weapon Calibres
STL["40 gauge"] = "calibre.40gauge"
L["calibre.40gauge"] = "40 калибр"
STL["10mm auto"] = "calibre.10mmauto"
L["calibre.10mmauto"] = "10-мм Auto"

-- Weapon Mechanisms
STL["blowback"] = "mechanism.blowback"
L["mechanism.blowback"] = "Отдача"

-- Tactical
L["name.go_flashlight_xhair"] = "Фонарик с перекрестием"
L["desc.go_flashlight_xhair"] = "Устанавливаемый фонарик с крестообразным рисунком. Узкое поле зрения, но немного помогает в прицеливании и светит довольно далеко. C этим фонариком ведётся прицельный огонь"
L["name.go_extras_boondoggle"] = "Поправленная рука"
L["name.go_extras_boondoggle2"] = "Поправленная рука"
L["name.go_extras_boondoggle3"] = "Поправленная рука"

-- Stocks
L["name.go_stock_bizon"] = "Приклад десантника"
L["desc.go_stock_bizon"] = "Лёгкий алюминиевый приклад, обычно используемый на оружии десантников. Обеспечивает большую мобильность, но ухудшает отдачу."
L["name.go_stock_m249"] = "Приклад SAW"
L["desc.go_stock_m249"] = "Длинный и прочный приклад, который можно легко удерживать при стрельбе от бедра. Позволяет вести контролируемую стрельбу от бедра, но очень тяжёлый."
L["name.go_stock_mp5"] = "Приклад «Болтун»"
L["desc.go_stock_mp5"] = "Сдвижной приклад от MP5. С ним как-то быстрее управляться."
L["name.go_stock_pistol_wire"] = "Кировский проволочный приклад"
L["desc.go_stock_pistol_wire"] = "Проволочный приклад для «Бизон», переделанный для использования в качестве пистолета. Он намного легче, чем обычный пистолетный приклад, и не так сильно снижает отдачу."
L["name.go_stock_ump"] = "Полицейский приклад"
L["desc.go_stock_ump"] = "Приклад, адаптированный под UMP. Эффективно снижает горизонтальную отдачу."

-- Perks
L["name.go_perk_hairtrigger"] = "Вспыльчивость"
L["desc.go_perk_hairtrigger"] = "Лёгкий и отточенный спусковой крючок позволяет значительно сократить задержку срабатывания."
L["name.go_perk_hyper"] = "Двойной стрелок"
L["desc.go_perk_hyper"] = "Переключение режима огня, позволяющее вести быстрый огонь очередями по два патрона и полуавтоматический огонь. Благодаря высокой скорострельности отдача при первом выстреле уменьшается."
L["name.go_perk_johnwick"] = "Джон Уик"
L["desc.go_perk_johnwick"] = "ты убил мою собаку"
L["name.go_perk_semi"] = "Снайперский курок"
L["desc.go_perk_semi"] = "Переключение режима огня на полуавтоматический, способный обеспечить очень высокую точность и очень устойчивую стрельбу."
L["name.perk_heatair"] = "Время остывания"
L["desc.perk_heatair"] = "Дайте ему проветриться! Тепло будет рассеиваться почти мгновенно, но медленнее. Кроме того, тепло отводится от оружия и превращается обратно в газ, увеличивая циклическую скорость."
L["name.perk_heatcap"] = "Человек в огне"
L["desc.perk_heatcap"] = "Справьтесь с перегревом! Теплоёмкость и скорость рассеивания тепла увеличиваются, но тепло снижает циклическую скорость."
L["name.perk_heatcool"] = "Хладнокровие"
L["desc.perk_heatcool"] = "Спокойно! Тепло будет рассеиваться как можно быстрее и скорее."
L["name.perk_heatfix"] = "Горячий гаечный ключ"
L["desc.perk_heatfix"] = "Просто стукните по нему! Перегрев будет устранён мгновенно, но тепло рассеивается медленнее."
L["name.perk_heatoverdrive"] = "Перегрузка"
L["desc.perk_heatoverdrive"] = "Безумно разрушительная модификация оружия, позволяющая ему выдерживать безумное количество тепла, извергая огонь как на пользователя, так и на противника."

-- Muzzles
L["name.go_usp_muzzle_match"] = "Матчевый компенсатор"
L["desc.go_usp_muzzle_match"] = "Специальный компенсатор для USP, значительно улучшающий контроль отдачи, точность и точность на при передвижении.\nОн занимает нижнюю планку, что делает невозможным использование креплений для оптики, рукоятей и затворов различной длины."

-- Magazines
L["name.go_deagle_mag_7_shot"] = "7 патронов 40 кал. Deagle"
L["desc.go_deagle_mag_7_shot"] = "Необычный ствол и магазин, подходящий под заказные патроны 40-го калибра, которые не слишком мощные из-за маленького диаметра ствола. Возможно, чья-то игрушка для стрельбы."
L["name.go_deagle_mag_8_44"] = "8 патронов .44 Deagle"
L["desc.go_deagle_mag_8_44"] = "Изменяет ствол и магазин под достаточно менее мощный патрон .44 Magnum. Он может вместить ещё один патрон в тот же магазин."
L["name.go_deagle_mag_9_357"] = "9 патронов .357 Deagle"
L["desc.go_deagle_mag_9_357"] = "Ствол и магазин, использующий более компактный и менее мощный патрон .357 Magnum. Благодаря меньшему размеру в один магазин помещается на 2 патрона больше."
L["name.go_deagle_mag_10_44"] = "10 патронов .44 Deagle"
L["desc.go_deagle_mag_10_44"] = "Расширенный магазин, изменённый под патрон .44 Magnum. Магазин будет тяжелее, но вмещает ещё больше патронов."
L["name.go_deagle_mag_12_357"] = "12 патронов .357 Deagle"
L["desc.go_deagle_mag_12_357"] = "Расширенный магазин, изменённый под патрон .357 Magnum. Если одной пули недостаточно, попробуйте сразу двенадцать."
L["name.go_fiveseven_mag_25_46"] = "25 патронов 4,6-мм HK"
L["desc.go_fiveseven_mag_25_46"] = "Необычный комплект, изменённый под патрон 4,6х30-мм. Хотя оба патрона являются тонкими патронами пистолета-пулемёта, 4,6-мм немного хуже на дальних дистанциях и позволяет зарядить большее количество патронов в магазин."
L["name.go_fiveseven_mag_40_46"] = "40 патронов 4,6-мм HK"
L["desc.go_fiveseven_mag_40_46"] = "Расширенный магазин заряжается патронами 4,6х30-мм. Это почти как детский MP7."
L["name.go_glock_mag_13_45acp"] = "13 патронов .45 ACP G21"
L["desc.go_glock_mag_13_45acp"] = "Изменяет оружие в Glock 21, стреляющий патронами .45 ACP. Вблизи он мощнее, чем 10-мм Auto, но заряжается меньшим количеством патронов из-за своих размеров."
L["name.go_glock_mag_15_10auto"] = "15 патронов 10-мм G20"
L["desc.go_glock_mag_15_10auto"] = "Изменяет оружие под патрон 10-мм Glock 20. Он мощнее 9-мм на любой дистанции, но отдача сильнее."
L["name.go_glock_mag_26_45acp"] = "26 патронов .45 ACP G21"
L["desc.go_glock_mag_26_45acp"] = "Расширенный магазин .45 ACP для пистолета Glock 21. Тяжёлый, но может вмещать больше патронов."
L["name.go_glock_mag_30_10auto"] = "30 патронов 10-мм G20"
L["desc.go_glock_mag_30_10auto"] = "Расширенный 10-мм магазин для Glock 20. Тяжёлый, но может вмещать больше патронов."
STL["20-Round 5.56mm Steel"] = "arccw_go_m16a2.magazine"
L["arccw_go_m16a2.magazine"] = "20 патронов 5,56-мм Steel"
L["name.go_m16a2_mag_30"] = "30 патронов 5,56-мм USGI"
L["desc.go_m16a2_mag_30"] = "Магазин стандартного размера с незначительным снижением управляемости."
L["name.go_p250_mag_9_45acp"] = "9 патронов .45 ACP P250"
L["desc.go_p250_mag_9_45acp"] = "Комплект ствола и магазина, изменённый под патрон .45 ACP. Он более мощный вблизи, но вмещает гораздо меньше патронов из-за своих размеров."
L["name.go_p250_mag_13_40sw"] = "13 патронов .40 S&W P250"
L["desc.go_p250_mag_13_40sw"] = "Комплект ствола и магазина, изменённый под патрон .40 S&W. На дальность стрельбы он действует несколько лучше, чем .357 SIG."
L["name.go_p250_mag_15_9mm"] = "15 патронов 9-мм P250"
L["desc.go_p250_mag_15_9mm"] = "Комплект ствола и магазина, изменённый под патрон 9-мм. Хотя он обладает меньшей останавливающей силой, в него можно зарядить больше патронов."
L["name.go_p250_mag_15_45acp"] = "15 патронов .45 ACP P250"
L["desc.go_p250_mag_15_45acp"] = "Расширенный магазин, изменённый под патрон .45 ACP."
L["name.go_p250_mag_20_22lr"] = "20 патронов .22 LR P250"
L["desc.go_p250_mag_20_22lr"] = "Комплект ствола и магазина, изменённый под патрон .22 LR. В качестве боевого патрона он наносит очень малый урон, но упрощенные внутренние компоненты позволяют добиться лучших характеристик."
L["name.go_p250_mag_21_40sw"] = "21 патрон .40 S&W P250"
L["desc.go_p250_mag_21_40sw"] = "Расширенный магазин, изменённый под патрон .40 S&W."
L["name.go_p250_mag_24_9mm"] = "24 патрона 9-мм P250"
L["desc.go_p250_mag_24_9mm"] = "Расширенный магазин, изменённый под патрон 9-мм."
L["name.go_p250_mag_35_22lr"] = "35 патронов .22 LR P250"
L["desc.go_p250_mag_35_22lr"] = "Расширенный магазин, изменённый под патрон .22 LR."
L["name.go_ssg08_mag_10_762"] = "10 патронов 7,62x51-мм НАТО"
L["desc.go_ssg08_mag_10_762"] = "Самодельный комплект магазина и ствола, модифицирующий оружие для стрельбы патронами 7,62x51-мм НАТО. Имеет значительно меньшую мощность, но более удобен в управлении."
L["name.go_usp_mag_15_9"] = "18 патронов 9-мм USP"
L["desc.go_usp_mag_15_9"] = "Изменяет пистолет под патрон 9-мм, позволяя увеличить ёмкость магазина и повысить управляемость."
L["name.go_usp_mag_25_9"] = "25 патронов 9-мм USP"
L["desc.go_usp_mag_25_9"] = "Расширенный магазин, изменённый под патрон 9-мм USP. Средняя длина уравновешивает повышенную ёмкость с увеличенным весом."
L["name.go_usp_mag_40_9"] = "40 патронов 9-мм USP"
L["desc.go_usp_mag_40_9"] = "Расширенный магазин, изменённый под патрон 9-мм USP. Тяжёлый, но может вмещать больше патронов."

-- Foregrips
L["name.go_foregrip_combat"] = "Штурмовая рукоять"
L["desc.go_foregrip_combat"] = "Лёгкая складная рукоять. Улучшает контроль отдачи при прицеливании."
L["name.go_foregrip_project"] = "Проектная рукоять"
L["desc.go_foregrip_project"] = "Снятая с пистолета-пулемёта оружие самообороны рукоять, используемая на P90. Рукоять, подходящая для космонавта."
L["name.go_foregrip_soup"] = "Кожаная рукоять"
L["desc.go_foregrip_soup"] = "Кольцо со свисающим с него кожаным ремнем. Очень маленькая площадь захвата, но маневренный."

-- Guns
-- Assault Rifles
L["name.arccw_go_galil_ar"] = "Автомат «Галиль»"
L["desc.arccw_go_galil_ar"] = "Штурмовая винтовка Израиля, созданная по образцу АК, но стреляющая патронами НАТО, со временем заменённая современным АСЕ."
L["desc.arccw_go_m16a2"] = "Ранняя американская штурмовая винтовка, созданная на основе AR-15. Эта модель широко использовалась во время войны во Вьетнаме. Она была создана для того, чтобы решить проблему ненадёжности M16A1 в джунглях и экономии боеприпасов при стрельбе очередями."

-- Barrels
STL["460mm ARM Barrel"] = "arccw_go_galil_ar.barrel"
L["arccw_go_galil_ar.barrel"] = "Ствол 460-мм ARM"
L["name.go_galil_ar_barrel_long"] = "Снайперский ствол 508-мм"
L["desc.go_galil_ar_barrel_long"] = "Длинный ствол «Галиль», используемый на снайперских и вариантах калибра 7,62-мм. Улучшает характеристики на дальность."
L["name.go_galil_ar_barrel_short"] = "Ствол 332-мм SAR"
L["desc.go_galil_ar_barrel_short"] = "Короткий ствол «Галиль», обеспечивающая повышенную мобильность за счёт снижения дальности и точности стрельбы."
STL["510mm A2 Barrel"] = "arccw_go_m16a2.barrel"
L["arccw_go_m16a2.barrel"] = "Ствол 510-мм A2"
L["name.go_m16a2_barrel_med"] = "Ствол винтовки 370-мм"
L["desc.go_m16a2_barrel_med"] = "Ствол средней длины, изначально использовавшийся на карабине M4."
L["name.go_m16a2_barrel_short"] = "Ствол 270-мм CAR"
L["desc.go_m16a2_barrel_short"] = "Короткий ствол CAR используется в ближнем бою в закрытых помещениях."

-- Ammo Types
L["name.go_ammo_airsoft"] = "Страйкбольные"
L["desc.go_ammo_airsoft"] = "Заменяет внутренние детали оружия, чтобы стрелять крошечными пластиковыми шариками ВВ, превратив оружие в игрушку. Хотя снаряд наносит минимальный урон, оружие может заряжаться гораздо большим количеством шариков и очень хорошо управляется.\nПомните, не использовать автоматы в зданиях!"
L["name.go_ammo_api"] = "О-БЗ! патроны"
L["desc.go_ammo_api"] = "Компания Omega производила бронебойные, зажигательные снаряды, которые пробивают цели и поджигают их. Выделяющийся при этом избыток тепла может легко сжечь боеприпасы неподготовленного пользователя."
L["name.go_ammo_magnum"] = "Патроны «Магнум»"
L["desc.go_ammo_magnum"] = "Заряжайте патроны опасным количеством пороха, меняя баллистику на мощь вблизи.\nНевозможно использовать с глушителями."
L["name.go_ammo_sg_dragon"] = "Зажигательные патроны"
L["desc.go_ammo_sg_dragon"] = "Прозванные многими «Дыханием дракона», эти ружейные патроны заряжены магниевым порохом, который воспламеняет всё, что находится впереди, когда он летит. Не имея фактического снарядного заряда, они наносят мало прямого урона."
L["name.go_ammo_sg_flechette"] = "Флешеттовые патроны"
L["desc.go_ammo_sg_flechette"] = "Тонкие, остроконечные снаряды обеспечивают лучшую дальнобойность и превосходную пробивную способность."

-- Stats
L["pro.gsoe.hairtrigger"] = "-60% Задержка спускового механизма"
L["pro.gsoe.foregrip_combat"] = "-25% Отдача при прицеливании"
L["pro.gsoe.stock_m249"] = "-30% Отдача, если не целиться"
L["pro.gsoe.perk_headshot"] = "+50% Урон при выстреле в голову"
L["pro.gsoe.burst"] = "Возможность ведения огня очередями"
L["con.gsoe.nog18"] = "Не может использоваться с затвором G18"
L["con.gsoe.cook"] = "Может перегреться и взорвать вас и магазин"
L["pro.gsoe.perk_underwater"] = "-50% Отдача под водой"

L["con.gsoe.heat_slow"] = "Более высокая температура снижает скорострельность"
L["pro.gsoe.heat_fast"] = "Более высокая температура повышает скорострельность"
L["pro.gsoe.heat_fix"] = "Температура рассеивается сразу после починки"

L["pro.pen.9"] = "Прострел 9-мм"
L["pro.pen.12"] = "Прострел 12-мм"
L["pro.pen.24"] = "Прострел 24-мм"
L["pro.num.8"] = "8 дробинок на выстрел"

L["pro.gsoe.stable"] = "Стабилизированный прицельный огонь"
L["con.gsoe.unstable"] = "Нестабилизированный прицельный огонь"

L["pro.gsoe.overdrive.1"] = "Продолжайте стрелять и наберите выше 100% тепла для перегрузки"
L["pro.gsoe.overdrive.2"] = "Урон увеличивается по мере увеличения перегрузки"
L["pro.gsoe.overdrive.3"] = "Шанс поджечь противника при превышении 200% перегрузки"

L["con.gsoe.overdrive.1"] = "Разброс увеличивается по мере увеличения перегрузки"
L["con.gsoe.overdrive.2"] = "Скорострельность уменьшается по мере увеличения перегрузки"
L["con.gsoe.overdrive.3"] = "Получение повреждений пользователя при 200% и выше уровня перегрузки"

L["desc.gsoe.overdrive.1"] = "Неисправность оружия при 300% и выше"
L["desc.gsoe.overdrive.2"] = "НЕ УВЕЛИЧИВАЙТЕ ПЕРЕГРУЗКУ ВЫШЕ 500%"

L["pro.gsoe.airsoft.1"] = "Стреляет шариковыми пульками"
L["pro.gsoe.airsoft.2"] = "Большая ёмкость магазина"
L["pro.gsoe.airsoft.3"] = "Отличная управляемость и отсутствие отдачи"

L["con.gsoe.airsoft.1"] = "Минимальный ущерб"

L["desc.gsoe.airsoft.1"] = "Использует шарики ВВ вместо обычных патронов"
L["desc.gsoe.airsoft.2"] = "Пользователи страйкбольного оружия мгновенно убивают друг друга"

L["pro.gsoe.dragonsbreath"] = "Выстреливает зажигательным порохом"
L["con.gsoe.dragonsbreath"] = "Снаряд имеет низкую скорость и высокую гравитацию"
L["con.gsoe.add_accuracymoa.30"] = "+30УМ неточности"


L["ui.gsoe.cook"] = "ВЗРЫВ! ПОТЕРЯНО %d ПУЛЬ"
L["ui.gsoe.overdrive"] = "ПЕРЕГРУЗКА"

L["fcg.fan"] = "Фаннинг"
L["fcg.fan.abbrev"] = "ФАН"
