L = {}

L["pro.gsoe.hairtrigger"] = "-60% Задержка спускового механизма"
L["pro.gsoe.foregrip_combat"] = "-25% Отдача при прицеливании"
L["pro.gsoe.stock_m249"] = "-30% Отдача, если не целиться"
L["pro.gsoe.perk_headshot"] = "+50% Урон при выстреле в голову"
L["pro.gsoe.burst"] = "Возможность ведения огня очередями"
L["con.gsoe.nog18"] = "Не может использоваться с затвором G18"
L["con.gsoe.cook"] = "Может перегреться и взорвать вас и магазин"
L["pro.gsoe.perk_underwater"] = "-50% Отдача под водой"

L["con.gsoe.heat_slow"] = "Более высокая температура снижает скорострельность"
L["pro.gsoe.heat_fast"] = "Более высокая температура повышает скорострельность"
L["pro.gsoe.heat_fix"] = "Температура рассеивается сразу после починки"

L["pro.pen.9"] = "Прострел 9-мм"
L["pro.pen.12"] = "Прострел 12-мм"
L["pro.pen.24"] = "Прострел 24-мм"
L["pro.num.8"] = "8 дробинок на выстрел"

L["pro.gsoe.stable"] = "Стабилизированный прицельный огонь"
L["con.gsoe.unstable"] = "Нестабилизированный прицельный огонь"

L["pro.gsoe.overdrive.1"] = "Продолжайте стрелять и наберите выше 100% тепла для перегрузки"
L["pro.gsoe.overdrive.2"] = "Урон увеличивается по мере увеличения перегрузки"
L["pro.gsoe.overdrive.3"] = "Шанс поджечь противника при превышении 200% перегрузки"

L["con.gsoe.overdrive.1"] = "Разброс увеличивается по мере увеличения перегрузки"
L["con.gsoe.overdrive.2"] = "Скорострельность уменьшается по мере увеличения перегрузки"
L["con.gsoe.overdrive.3"] = "Получение повреждений пользователя при 200% и выше уровня перегрузки"

L["desc.gsoe.overdrive.1"] = "Неисправность оружия при 300% и выше"
L["desc.gsoe.overdrive.2"] = "НЕ УВЕЛИЧИВАЙТЕ ПЕРЕГРУЗКУ ВЫШЕ 500%"

L["pro.gsoe.dragonsbreath"] = "Выстреливает зажигательным порохом"
L["con.gsoe.dragonsbreath"] = "Снаряд имеет низкую скорость и высокую гравитацию"
L["con.gsoe.add_accuracymoa.30"] = "+30УМ неточности"


L["ui.gsoe.cook"] = "ВЗРЫВ! ПОТЕРЯНО %d ПУЛЬ"
L["ui.gsoe.overdrive"] = "ПЕРЕГРУЗКА"

L["fcg.fan"] = "Вентиляция"
L["fcg.fan.abbrev"] = "ВЕН"